коннект1/src/Catalogs/logs/logs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>logs</name>
  <attributes>
    <name>brand</name>
    <type>
      <types>EnumRef.brandTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>duration</name>
    <comment>В миллисекундах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ipAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>isError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>period</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>request</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>requestName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>response</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>statusCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>token</name>
    <type>
      <types>CatalogRef.tokens</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
</mdclass:Catalog>

коннект1/src/Catalogs/logs/Forms/ListForm/Module.bsl
&AtServerNoContext
Function getResponseBody(log)		
	CompressedBinaryData	= log.request.Get();
	request	= ?(CompressedBinaryData = Undefined, "", XDTOSerializer.XMLValue(Type("ValueStorage"), Base64String(CompressedBinaryData)).Get());	
	CompressedBinaryData	= log.response.Get();
	response	=  ?(CompressedBinaryData = Undefined, "", XDTOSerializer.XMLValue(Type("ValueStorage"), Base64String(CompressedBinaryData)).Get());
	Return New Structure("request, response", request, response);
EndFunction

&AtClient
Procedure ListValueChoice(Item, Value, StandardProcessing)
	StandardProcessing	= False;
	CurrentData	= Items.List.CurrentData;
	If CurrentData <> Undefined Then
		formParameters	= New Structure("key", CurrentData.token);
		OpenForm("Catalog.tokens.ObjectForm", formParameters, ThisForm,,,,, FormWindowOpeningMode.Independent);
	EndIf;	
EndProcedure

&AtClient
Procedure ListOnActivateRow(Item)
	CurrentRow	= Items.List.CurrentRow;
	If CurrentRow <> Undefined Then
		answer		= getResponseBody(CurrentRow);
		request		= answer.request;
		response	= answer.response;
	EndIf;
EndProcedure
